src/DataProcessors/ЖурналЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЖурналЗаказов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЖурналЗаказов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗакрытых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНедозакрытых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЗаказДопИнф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаказДопИнф</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколРасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАвторизации</Name>
					<Comment>дата/время регистрации карты лояльности в заказе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ЖурналЗаказов/Forms/Форма9/module.bsl
Перем ЦветПейджер;
Перем ЦветПриготовление;
Перем ЦветКВыдаче;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
	
	
КонецПроцедуры

Процедура ПриОткрытии()
		
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	глОтсечкаПростоя();
	
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыходИзЗаказа" Тогда
		ОбновитьЖурнал(Параметр);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
		ЭлементыФормы.ПанельЖурналы.ТекущаяСтраница = ЭлементыФормы.ПанельЖурналы.Страницы.ОткрытыеЗаказы;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ЖурналЗаказовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если СводныйЖурнал Тогда
		Возврат;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьТекст  = Ложь;
	
	Если ДанныеСтроки.Пиктограмма=0 Тогда
		ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьКартинку = Ложь;
	Иначе
		ОформлениеСтроки.Ячейки.Пиктограмма.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Пиктограмма.ИндексКартинки = ДанныеСтроки.Пиктограмма-1;
	КонецЕсли; 
	
	
	Если НЕ ДоставкаЖурнал Тогда // На "НЕ СводныйЖурнал" уже есть проверка выше
		Если ДанныеСтроки.Пейджер > 0 Тогда
			ОформлениеСтроки.Ячейки.Пейджер.ЦветФона = ЦветПейджер;
		КонецЕсли; 
		
		Если ДанныеСтроки.ПриготовлениеПросрочено > 0 Тогда
			ОформлениеСтроки.Ячейки.Приготовление.ЦветФона = ЦветПриготовление;
		КонецЕсли; 
		
		Если ДанныеСтроки.КВыдачеПросрочено > 0 Тогда
			ОформлениеСтроки.Ячейки.КВыдаче.ЦветФона = ЦветКВыдаче;
		КонецЕсли; 
		
		Если ДанныеСтроки=Элемент.ТекущаяСтрока Тогда
			Для Каждого Ячейка Из ОформлениеСтроки.Ячейки Цикл
				Если Не (Ячейка.Имя = "Пейджер" ИЛИ Ячейка.Имя = "Приготовление" ИЛИ Ячейка.Имя = "КВыдаче") Тогда
					Ячейка.ЦветФона = Элемент.ЦветФонаВыделения;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого стрМестоРеализации Из Массив("МЪ","О","КП") Цикл
			Ячейка = ОформлениеСтроки.Ячейки["Сумма"+стрМестоРеализации];
			Сумма = ДанныеСтроки["Сумма"+стрМестоРеализации];
			Оплачено = ДанныеСтроки["Оплачено"+стрМестоРеализации];
			Если ЗначениеЗаполнено(Сумма) И Оплачено >= Сумма Тогда
				Ячейка.ЦветФона = ЦветаСтиля.ЦветФонаОплаченнойСтроки;
			ИначеЕсли Оплачено Тогда
				Ячейка.ЦветФона = ЦветаСтиля.ЦветФонаНедоплаченнойСтроки;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;	
	// КС_ВДВ > ------------------------------------------------------------ 
КонецПроцедуры

Процедура КнопкаВозвратНажатие(Элемент)
	
	ВозвратПоЗаказу();
	
КонецПроцедуры

Процедура КнопкаПоискНажатие(Элемент)
	
	Если НЕ ДоставкаЖурнал Тогда
		// < КС_ВДВ ------------------------------------------------------------ 
		//ПолучитьФорму("Поиск").ОткрытьМодально();
		
		//ПоискЗаказаПоКартеДоступа(); // запрос на ввод карты, и далее открытие заказа
		ПоискЗаказаПоНомеру();
		// КС_ВДВ > ------------------------------------------------------------ 
	Иначе
		ПолучитьФорму("ПоискДоставка").ОткрытьМодально();
	КонецЕсли; 
	//Z+
	ОбновитьЖурнал();
	//Z-
КонецПроцедуры

Процедура КнопкаМестоНажатие(Элемент)
	
	ИзменитьЗаказ("ИзменитьМесто");
	
КонецПроцедуры

Процедура КнопкаАвторНажатие(Элемент)
	
	ИзменитьЗаказ("ИзменитьАвтора");
	
КонецПроцедуры

Процедура КнопкаГостиНажатие(Элемент)
	
	ИзменитьЗаказ("ИзменитьКолвоГостей");
	
КонецПроцедуры

Процедура КнопкаУдалитьНажатие(Элемент)
	
	УдалитьЗаказ();
	
КонецПроцедуры

Процедура КнопкаНовыйНажатие(Элемент)
	
	СоздатьНовыйЗаказ();
	
КонецПроцедуры

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	ТекущийЭлемент = ЭлементыФормы.ЖурналЗаказов;
	WshShell.SendKeys("{PGUP}");
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	ТекущийЭлемент = ЭлементыФормы.ЖурналЗаказов;
	WshShell.SendKeys("{PGDN}");
	
КонецПроцедуры

Процедура КнопкаВначалоНажатие(Элемент)
	ТекущийЭлемент = ЭлементыФормы.ЖурналЗаказов;
	WshShell.SendKeys("{HOME}");
КонецПроцедуры

Процедура КнопкаВконецНажатие(Элемент)
	ТекущийЭлемент = ЭлементыФормы.ЖурналЗаказов;
	WshShell.SendKeys("{END}");
КонецПроцедуры

Процедура КнопкаВыбратьНажатие(Элемент)
	
	ЖурналЗаказовВыбор(0,ЭлементыФормы.ЖурналЗаказов.ТекущаяСтрока, 0, Ложь);
	
КонецПроцедуры

Процедура ЖурналЗаказовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока.Пейджер И Колонка = ЭлементыФормы.ЖурналЗаказов.Колонки.Пейджер Тогда
		ксТрактир.ВыполнитьВозвратПейджера(ВыбраннаяСтрока.ДокСсылка,,Истина);		
		ОбновитьЖурнал();
	Иначе
		Закрыть();		
		глОбработки.ГлавнаяФорма.ОткрытьЗаказ(ВыбраннаяСтрока.ДокСсылка);
	КонецЕсли;
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ПАНЕЛИ ПОИСКА ПО ПОДСТРОКЕ

Процедура КнопкаПоискПоСтрокеНажатие(Элемент)
	
	// Видимость подстроки поиска
		
КонецПроцедуры

Процедура КнопкаКопияЧекаНажатие(Элемент)
	пЗаказ = ЭлементыФормы.ЖурналЗаказов.ТекущиеДанные.ДокСсылка;
	Если пЗаказ=Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(пЗаказ) = Тип("ДокументСсылка.Заказ") Тогда
		ЗаказДопИнф = РегистрыСведений.ЗаказДопИнф.СоздатьМенеджерЗаписи();
		ЗаказДопИнф.Заказ = пЗаказ.Ссылка;
		ЗаказДопИнф.Прочитать();
		
		Если Не ЗаказДопИнф.Статус = Перечисления.СтатусыЗаказа.Закрыт тогда
			возврат;
		КонецЕсли;
		//-------------------------------------
		глОжидание.Начало("Выполняется печать...",
						"Идет печать заданий на сервис-принтерах.
						|Пожалуйста, подождите...");
		
		ОбработкаПечати = ИнтерфейсРМ.ПолучитьОбъектОбработки("ПечатьЗаказа");
		ОбработкаПечати.Заказ			= пЗаказ;
		ОбработкаПечати.ЗаказДопИнф		 = ЗаказДопИнф;
		ОбработкаПечати.ПротоколРасчетов = ЗаказДопИнф.ПротоколРасчетов;
		ОбработкаПечати.ФоновыйРежим	 = ложь;
		
		ПечатьОК = ОбработкаПечати.ПечатьКопииЧека();
		глОжидание.Конец();
	ИначеЕсли ТипЗнч(пЗаказ) = Тип("ДокументСсылка.Возврат") Тогда
		ЗаказДопИнф = РегистрыСведений.ЗаказДопИнф.СоздатьМенеджерЗаписи();
		ЗаказДопИнф.Заказ = пЗаказ.Заказ;
		ЗаказДопИнф.Прочитать();
		
		Если Не ЗаказДопИнф.Статус = Перечисления.СтатусыЗаказа.Закрыт тогда
			возврат;
		КонецЕсли;
		глОжидание.Начало("Выполняется печать...",
						"Идет печать заданий на сервис-принтерах.
						|Пожалуйста, подождите...");
		
		ОбработкаПечати = ИнтерфейсРМ.ПолучитьОбъектОбработки("ПечатьЗаказа");
		ОбработкаПечати.Заказ			= пЗаказ.Заказ;
		ОбработкаПечати.ЗаказДопИнф		 = ЗаказДопИнф;
		ОбработкаПечати.ПротоколРасчетов = ЗаказДопИнф.ПротоколРасчетов;
		ОбработкаПечати.ФоновыйРежим	 = ложь;
		
		ПечатьОК = ОбработкаПечати.ПечатьКопииЧекаВозврата(пЗаказ);
		глОжидание.Конец();
	КонецЕсли;
КонецПроцедуры

Процедура Панель1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьВидимостьКнопок();	
	Если ТекущаяСтраница = Элемент.Страницы.ОткрытыеЗаказы Тогда
		ОбновитьЖурнал();
	Иначе
		ОбновитьСтатистику();
	КонецЕсли;
	ТекущийЭлемент = ЭлементыФормы.КнопкаВыбрать;
КонецПроцедуры

Процедура УстановитьВидимостьКнопок() Экспорт
	Если ЭлементыФормы.ПанельЖурналы.ТекущаяСтраница = ЭлементыФормы.ПанельЖурналы.Страницы.ОткрытыеЗаказы Тогда
		ЭлементыФормы.КнопкаВконец.Видимость = Истина;	
		ЭлементыФормы.КнопкаПоиск.Видимость = Истина;	
		ЭлементыФормы.КнопкаСтрелкаВверх.Видимость = Истина;	
		ЭлементыФормы.КнопкаСтрелкаВниз.Видимость = Истина;	
		ЭлементыФормы.КнопкаВыбрать.Видимость = Истина;	
		ЭлементыФормы.КнопкаВначало.Видимость = Истина;	
		ОбновитьЖурнал();
	Иначе
		
		ЭлементыФормы.КнопкаВконец.Видимость = Ложь;	
		ЭлементыФормы.КнопкаПоиск.Видимость = Ложь;	
		ЭлементыФормы.КнопкаСтрелкаВверх.Видимость = Ложь;	
		ЭлементыФормы.КнопкаСтрелкаВниз.Видимость = Ложь;	
		ЭлементыФормы.КнопкаВначало.Видимость = Ложь;	
		ЭлементыФормы.КнопкаВыбрать.Видимость = Ложь;	
		ОбновитьСтатистику();
	КонецЕсли;
	
		
КонецПроцедуры

Процедура ЖурналЗаказовПриАктивизацииСтроки(Элемент)
	Элемент.ОбновитьСтроки();
КонецПроцедуры


// < КС_ВДВ ------------------------------------------------------------ 
ЦветПейджер			= ЦветаСтиля.Акцент;
ЦветПриготовление	= ЦветаСтиля.ЦветЗаказано;
ЦветКВыдаче			= ЦветаСтиля.ЦветГотово;
// КС_ВДВ > ------------------------------------------------------------
